import React, { useContext, useEffect, useState } from 'react';
import { useNavigate } from 'react-router-dom';
import './Styles/Welcome.css';
import  {TypeContext} from "./Context";


const Welcome = () => {
    const navigate = useNavigate();
    const [isButtonVisible, setButtonVisible] = useState(true);
    const [inputValue, setInputValue] = useState('');
    const [json, setJson] = useState('')
    const {type,setTypeValue,color,setColorTheme} = useContext(TypeContext)
    const backendUrl = process.env.REACT_APP_BACKEND_URL;

    useEffect(() => {
        loginButton();
    }, []);

    useEffect(() => {
        console.log("Type updated:", type);
        // пример: переход на другую страницу после обновления type
    }, [type]); // отслеживаем изменения в type


    const loginButton = async () => {
        try {
            const response = await fetch(`${backendUrl}/api/authorization`, {
                method: 'GET',
                credentials: 'include'
            });
            if (response.status === 200) {
                setButtonVisible(false);
            } else {
                setButtonVisible(true);
            }
        } catch (error) {
            console.error('Failed to fetch authorization:', error);
        }
    };

    const redirectToLogin = () => {
        navigate('/login');
    };

    const redirectTo =  (typeOf) => {
        setTypeValue(typeOf);
        if(typeOf==="pdfextraction"){
            setTimeout(() => {
                // Второе действие: переключаем состояние создания нового чата
                navigate("/converter_crop")
            }, 200); // Задержка в миллисекундах (1000ms = 1 секунда)
        }
        else {
            setTimeout(() => {
                // Второе действие: переключаем состояние создания нового чата
                navigate("/converter")
            }, 200);
        }// Задержка в миллисекундах (1000ms = 1 секунда)
        console.log(type)
    };


    const redirectToProfile = async () => {
                navigate('/profile');
    };

    const redirectToAudioList = () => {
        navigate('/audio_playlist');
    };

    const handleInputChange = (event) => {
        setInputValue(event.target.value);
    };
    const setTheme = () =>{
        setColorTheme(!color)
        document.body.style.backgroundColor = color ? "#353845": "#cccccc";
    }

    return (
        <div className="container">
            {isButtonVisible && (
                <button className="Reg_button" onClick={redirectToLogin}>
                    Войти или зарегаться
                </button>
            )}
            <img className={"img_theme"} onClick={()=>setTheme()} src={color?"https://react-news-delta.vercel.app/assets/light-6ca11da7.png":"https://react-news-delta.vercel.app/assets/dark-b70e412a.png" } width="30" alt="theme"/>

            <div className={color ? "titleForConv light" : "titleForConv"}>Конвертация</div>
            <div className="tools__container">
                <div className={color ? "tools__item light" : "tools__item"} onClick={() => redirectTo("docxtopdf")}>
                    <a onClick={() => redirectTo("pdfToDoc")}>
                        <div className="tools__item__icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 50 50">
                                <path
                                    d="M17.676 34.344h9.55c2.477 0 3.375-.258 4.28-.742a5.04 5.04 0 0 0 2.098-2.102c.484-.902.742-1.8.742-4.277v-9.547H44.82c1.8 0 2.453.188 3.113.54s1.176.87 1.527 1.527.54 1.31.54 3.113V44.82c0 1.8-.187 2.453-.54 3.113a3.69 3.69 0 0 1-1.527 1.527c-.66.352-1.312.54-3.113.54H22.855c-1.8 0-2.453-.187-3.113-.54s-1.172-.87-1.527-1.527-.54-1.312-.54-3.113zm0 0"
                                    fillRule="evenodd" fill="rgb(37.254902%,51.372549%,77.647059%)"></path>
                                <path
                                    d="M43.94 37.137c0-.477-.395-.863-.883-.863s-.883.387-.883.863v3.844l-5.145-5.047c-.348-.34-.902-.34-1.25 0a.85.85 0 0 0-.258.609.86.86 0 0 0 .258.613l5.145 5.05h-3.914c-.488 0-.883.387-.883.867s.395.867.883.867h6.05c.113-.004.227-.023.336-.07a.87.87 0 0 0 .477-.465c.05-.105.066-.22.066-.332l.004-5.934zm0 0"
                                    fill="rgb(100%,100%,100%)"></path>
                                <path
                                    d="M27.145 32.324H5.18c-1.8 0-2.453-.187-3.113-.543S.89 30.914.54 30.254 0 28.95 0 27.145V5.18c0-1.8.188-2.453.54-3.113A3.69 3.69 0 0 1 2.066.539C2.727.188 3.38 0 5.18 0h21.965c1.8 0 2.453.188 3.113.54s1.172.87 1.527 1.527.54 1.313.54 3.113v21.965c0 1.8-.187 2.453-.54 3.113s-.87 1.176-1.527 1.527-1.312.54-3.113.54zm0 0"
                                    fillRule="evenodd" fill="rgb(86.27451%,89.803922%,98.039216%)"></path>
                                <path
                                    d="M20.844 8.61h2.96l-2.94 14.64H17.77l-1.777-9.035-1.824 9.035h-3.203L8.04 8.61h3.164l1.508 9.363 1.938-9.363h3.004l.04.203 1.688 9.1zm0 0"
                                    fill="rgb(16.078431%,34.117647%,58.431373%)"></path>
                            </svg>
                        </div>
                        <h3>Word в PDF</h3>
                        <div className="tools__item__content">
                            <p>Конвертировать ваши документы в PDF-файл, который будет таким же самым как и оригинальный
                                DOC
                                или DOCX.</p>
                        </div>
                    </a>
                </div>
                <div className={color ? "tools__item light" : "tools__item"} onClick={() => redirectTo("jpgtopdf")}>
                    <a title="JPG в PDF">
                        <div className="tools__item__icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 50 50">
                                <path
                                    d="M17.676 34.344h9.55c2.477 0 3.375-.258 4.28-.742a5.04 5.04 0 0 0 2.098-2.102c.484-.902.742-1.8.742-4.277v-9.547H44.82c1.8 0 2.453.188 3.113.54s1.176.87 1.527 1.527.54 1.31.54 3.113V44.82c0 1.8-.187 2.453-.54 3.113a3.69 3.69 0 0 1-1.527 1.527c-.66.352-1.312.54-3.113.54H22.855c-1.8 0-2.453-.187-3.113-.54s-1.172-.87-1.527-1.527-.54-1.312-.54-3.113zm0 0"
                                    fill-rule="evenodd" fill="rgb(98.431373%,93.72549%,65.882353%)"></path>
                                <path
                                    d="M43.94 37.137c0-.477-.395-.863-.883-.863s-.883.387-.883.863v3.844l-5.145-5.047c-.348-.34-.902-.34-1.25 0a.85.85 0 0 0-.258.609.86.86 0 0 0 .258.613l5.145 5.05h-3.914c-.488 0-.883.387-.883.867s.395.867.883.867h6.05c.113-.004.227-.023.336-.07a.87.87 0 0 0 .477-.465c.05-.105.066-.22.066-.332l.004-5.934zm0 0"
                                    fill="rgb(71.764706%,62.745098%,0.392157%)"></path>
                                <g fill-rule="evenodd">
                                    <path
                                        d="M5.184 0h21.988c1.8 0 2.453.188 3.113.54.652.344 1.184.88 1.527 1.53.352.656.54 1.313.54 3.113v21.984c0 1.805-.187 2.457-.54 3.117-.344.648-.875 1.184-1.527 1.527-.66.352-1.312.54-3.113.54H5.184c-1.8 0-2.457-.187-3.113-.54-.652-.344-1.184-.88-1.527-1.527C.188 29.625 0 28.973 0 27.168V5.184c0-1.8.188-2.457.54-3.113.344-.652.88-1.184 1.53-1.53S3.383 0 5.184 0zm0 0"
                                        fill="rgb(83.921569%,74.901961%,17.647059%)"></path>
                                    <path
                                        d="M10.28 12.945v4.688c0 1.66-.926 2.66-2.707 2.66C5.406 20.293 5 18.852 5 18.07c0-.668.31-1.098.86-1.098.648 0 .813.504.813 1.05 0 .516.242.89.88.89.594 0 .926-.44.926-1.3V12.95c0-.54.352-.898.902-.898s.902.36.902.898zm1.672 6.402v-6.102c0-.8.418-1.055 1.055-1.055h2.762c1.516 0 2.738.75 2.738 2.508 0 1.44-1 2.508-2.75 2.508h-2v2.152c0 .54-.355.902-.902.902s-.902-.363-.902-.902zm1.805-5.773v2.242h1.68c.727 0 1.266-.437 1.266-1.12 0-.793-.56-1.12-1.45-1.12zm13.285 3.1v2.984c0 .332-.254.602-.613.602-.52 0-.66-.32-.773-1.023-.516.648-1.23 1.066-2.352 1.066-2.793 0-3.863-1.926-3.863-4.145 0-2.676 1.672-4.148 4.125-4.148 2.004 0 3.07 1.2 3.07 1.902 0 .63-.46.793-.848.793-.89 0-.56-1.242-2.32-1.242-1.242 0-2.223.813-2.223 2.816 0 1.56.77 2.637 2.246 2.637.957 0 1.793-.648 1.88-1.617H24.2c-.383 0-.812-.14-.812-.69 0-.44.254-.69.703-.69h2.223c.527 0 .738.262.738.758zm0 0"
                                        fill="rgb(100%,100%,100%)"></path>
                                </g>
                            </svg>
                        </div>
                        <h3>JPG в PDF</h3>
                        <div className="tools__item__content">
                            <p>Конвертируйте ваши изображения в формат PDF. Регуляция ориентации и полей.</p>
                        </div>
                    </a>
                </div>
                <div className={color ? "tools__item light" : "tools__item"} onClick={() => redirectTo("xlstopdf")}>
                    <a title="Excel в PDF">
                        <div className="tools__item__icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 50 50">
                                <path
                                    d="M17.676 34.344h9.55c2.477 0 3.375-.258 4.28-.742a5.04 5.04 0 0 0 2.098-2.102c.484-.902.742-1.8.742-4.277v-9.547H44.82c1.8 0 2.453.188 3.113.54s1.176.87 1.527 1.527.54 1.31.54 3.113V44.82c0 1.8-.187 2.453-.54 3.113a3.69 3.69 0 0 1-1.527 1.527c-.66.352-1.312.54-3.113.54H22.855c-1.8 0-2.453-.187-3.113-.54s-1.172-.87-1.527-1.527-.54-1.312-.54-3.113zm0 0"
                                    fill-rule="evenodd" fill="rgb(36.862745%,63.137255%,38.431373%)"></path>
                                <path
                                    d="M43.94 37.137c0-.477-.395-.863-.883-.863s-.883.387-.883.863v3.844l-5.145-5.047c-.348-.34-.902-.34-1.25 0a.85.85 0 0 0-.258.609.86.86 0 0 0 .258.613l5.145 5.05h-3.914c-.488 0-.883.387-.883.867s.395.867.883.867h6.05c.113-.004.227-.023.336-.07a.87.87 0 0 0 .477-.465c.05-.105.066-.22.066-.332l.004-5.934zm0 0"
                                    fill="rgb(100%,100%,100%)"></path>
                                <g fill-rule="evenodd">
                                    <path
                                        d="M27.145 32.324H5.18c-1.8 0-2.453-.187-3.113-.543S.89 30.914.54 30.254 0 28.95 0 27.145V5.18c0-1.8.188-2.453.54-3.113A3.69 3.69 0 0 1 2.066.539C2.727.188 3.38 0 5.18 0h21.965c1.8 0 2.453.188 3.113.54s1.172.87 1.527 1.527.54 1.313.54 3.113v21.965c0 1.8-.187 2.453-.54 3.113s-.87 1.176-1.527 1.527-1.312.54-3.113.54zm0 0"
                                        fill="rgb(76.078431%,89.803922%,76.470588%)"></path>
                                    <path
                                        d="M19.11 23.5l-2.508-4.72c-.102-.176-.195-.5-.3-.973h-.04c-.047.223-.16.56-.336 1.012L13.4 23.5H9.5l4.64-7.25L9.895 9h3.992l2.082 4.348c.164.344.313.754.438 1.227h.04c.082-.285.234-.703.457-1.266L19.22 9h3.66l-4.37 7.19L23 23.5zm0 0"
                                        fill="rgb(18.039216%,44.705882%,21.568627%)"></path>
                                </g>
                            </svg>
                        </div>
                        <h3>Excel в PDF</h3>
                        <div className="tools__item__content">
                            <p>Преобразование ваших таблиц с колонками в PDF файл, с учетом ширины PDF. Книжная или
                                альбомная ориентация. Ваш выбор.</p>
                        </div>
                    </a>
                </div>
            </div>
            <div className={color ? "tittleForTools light" : "tittleForTools"}>Инструменты</div>
            <div className="tools__containerForTools">
                <div className={color ? "tools__item light" : "tools__item"} onClick={() => redirectTo("pdfmerge")}>
                    <a title="Объединить PDF">
                        <div className="tools__item__icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 50 50">
                                <g fill="rgb(93.333333%,42.352941%,30.196078%)" fill-rule="evenodd">
                                    <path
                                        d="M5.488.363h21.75c1.78 0 2.43.184 3.082.535a3.66 3.66 0 0 1 1.512 1.512c.348.652.535 1.297.535 3.082v21.746c0 1.78-.187 2.43-.535 3.082a3.66 3.66 0 0 1-1.512 1.512c-.652.348-1.3.535-3.082.535H5.488c-1.78 0-2.43-.187-3.082-.535A3.66 3.66 0 0 1 .895 30.32c-.348-.652-.535-1.3-.535-3.082V5.488c0-1.78.188-2.43.535-3.082A3.71 3.71 0 0 1 2.406.895c.652-.348 1.3-.53 3.082-.53zm0 0"></path>
                                    <path
                                        d="M44.563 49.69H22.816c-1.78 0-2.43-.184-3.082-.535-.645-.34-1.172-.867-1.512-1.512-.348-.652-.535-1.297-.535-3.082V22.816c0-1.78.184-2.43.535-3.082.34-.645.867-1.172 1.512-1.512.652-.348 1.3-.535 3.082-.535h21.746c1.785 0 2.43.188 3.082.535.645.34 1.172.867 1.512 1.512.352.652.535 1.3.535 3.082v21.746c0 1.785-.184 2.43-.535 3.082-.34.645-.867 1.172-1.512 1.512-.652.352-1.297.535-3.082.535zm0 0"></path>
                                </g>
                                <path
                                    d="M17.906 10.965c-.484 0-.875.387-.875.86v3.8L9.84 8.523c-.344-.336-.895-.336-1.238 0-.164.16-.254.38-.254.605a.86.86 0 0 0 .254.6l7.195 7.098h-3.875c-.484 0-.875.387-.875.86s.4.86.875.86h5.984a.88.88 0 0 0 .332-.066.86.86 0 0 0 .473-.465.79.79 0 0 0 .066-.328v-5.87c.004-.473-.387-.86-.87-.86zm14.418 28.008c.48 0 .87-.383.87-.86v-3.797l7.195 7.098a.88.88 0 0 0 1.234 0 .85.85 0 0 0 .258-.605c0-.23-.094-.45-.258-.605l-7.2-7.102h3.875c.484 0 .875-.383.875-.86s-.4-.855-.875-.855h-5.984a.92.92 0 0 0-.336.066c-.2.086-.383.25-.473.46a.88.88 0 0 0-.066.328v5.87c0 .477.4.86.875.86zm-10.1-10.1c-.355.352-.93.352-1.285 0s-.355-.934 0-1.3a.91.91 0 0 1 1.285 0c.355.352.355.934 0 1.3zm3.374-3.357a.91.91 0 0 1-1.285 0 .91.91 0 0 1 0-1.285c.352-.352.93-.352 1.285 0a.91.91 0 0 1 0 1.285zm3.36-3.364a.91.91 0 0 1-1.285 0 .91.91 0 0 1 0-1.285.91.91 0 0 1 1.285 0 .91.91 0 0 1 0 1.285zm0 0"
                                    fill="rgb(100%,100%,100%)"></path>
                            </svg>
                        </div>
                        <h3>Объединить PDF</h3>
                        <div className="tools__item__content">
                            <p>Объединяйте PDF файлы и упорядочите их легко и быстро в любом порядке, который вам
                                нравится.</p>
                        </div>
                    </a>
                </div>
                <div className={color ? "tools__item light" : "tools__item"} onClick={() => redirectTo("watermarkpdf")}>
                    <a title="Водяной знак">
                        <div className="tools__item__icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 50 50">
                                <path
                                    d="M8.012 0h33.977c2.785 0 3.797.29 4.813.836a5.65 5.65 0 0 1 2.363 2.363C49.71 4.215 50 5.227 50 8.012v33.977c0 2.785-.29 3.797-.836 4.813a5.65 5.65 0 0 1-2.363 2.363c-1.016.547-2.027.836-4.812.836H8.012c-2.785 0-3.797-.29-4.816-.836S1.38 47.82.836 46.8 0 44.773 0 41.988V8.012C0 5.227.29 4.215.836 3.2A5.65 5.65 0 0 1 3.199.836C4.215.29 5.227 0 8.012 0zm0 0"
                                    fill-rule="evenodd" fill="rgb(67.058824%,41.176471%,57.647059%)"></path>
                                <path
                                    d="M22.7 22.523c0 .863-1.094 3.023-2.11 4.668a.68.68 0 0 0-.078.523c.078.277.328.47.61.47h7.75a.63.63 0 0 0 .566-.352.65.65 0 0 0-.055-.672c-1.445-1.97-2.1-3.398-2.1-4.633s.645-2.66 2.094-4.637c.664-.937 1.012-2.043 1.012-3.195 0-3.02-2.422-5.477-5.398-5.477s-5.398 2.45-5.398 5.473a5.49 5.49 0 0 0 1.02 3.203c1.44 1.97 2.086 3.398 2.086 4.63zm14.02 6.55H13.266a.64.64 0 0 0-.633.645v6.465c0 .352.285.645.633.645H36.72a.64.64 0 0 0 .633-.645V29.72c0-.352-.285-.645-.633-.645zm-3.582 8.7H16.863a.64.64 0 0 0-.633.645v.727c0 .352.285.645.633.645h16.273a.64.64 0 0 0 .633-.645v-.727c0-.352-.285-.645-.633-.645zm0 0"
                                    fill="rgb(100%,100%,100%)"></path>
                            </svg>
                        </div>
                        <h3>Водяной знак</h3>
                        <div className="tools__item__content">
                            <p>Выберите изображение или текст, которые вы хотите вставить в ваш PDF. Выберите положение,
                                прозрачность и шрифт.</p>
                        </div>
                    </a>
                </div>
                <div className={color ? "tools__item light" : "tools__item"}
                     onClick={() => redirectTo("pdfextraction")}>
                    <a title="Разделить PDF">
                        <div className="tools__item__icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 50 50">
                                <g fill="rgb(93.333333%,42.352941%,30.196078%)" fill-rule="evenodd">
                                    <path
                                        d="M5.488.363h21.75c1.78 0 2.43.184 3.082.535a3.66 3.66 0 0 1 1.512 1.512c.348.652.535 1.297.535 3.082v21.746c0 1.78-.187 2.43-.535 3.082a3.66 3.66 0 0 1-1.512 1.512c-.652.348-1.3.535-3.082.535H5.488c-1.78 0-2.43-.187-3.082-.535A3.66 3.66 0 0 1 .895 30.32c-.348-.652-.535-1.3-.535-3.082V5.488c0-1.78.188-2.43.535-3.082A3.71 3.71 0 0 1 2.406.895c.652-.348 1.3-.53 3.082-.53zm0 0"></path>
                                    <path
                                        d="M44.563 49.69H22.816c-1.78 0-2.43-.184-3.082-.535-.645-.34-1.172-.867-1.512-1.512-.348-.652-.535-1.297-.535-3.082V22.816c0-1.78.184-2.43.535-3.082.34-.645.867-1.172 1.512-1.512.652-.348 1.3-.535 3.082-.535h21.746c1.785 0 2.43.188 3.082.535.645.34 1.172.867 1.512 1.512.352.652.535 1.3.535 3.082v21.746c0 1.785-.184 2.43-.535 3.082-.34.645-.867 1.172-1.512 1.512-.652.352-1.297.535-3.082.535zm0 0"></path>
                                </g>
                                <path
                                    d="M9.22 15.87c.484 0 .875-.387.875-.86v-3.8l7.195 7.102a.88.88 0 0 0 1.234 0 .85.85 0 0 0 0-1.215L11.328 10h3.875c.484 0 .875-.387.875-.86s-.4-.86-.875-.86H9.22a.88.88 0 0 0-.332.066.86.86 0 0 0-.539.793v5.875c0 .473.4.86.87.86zm31.793 18.2c-.484 0-.875.383-.875.855v3.8L32.94 31.63a.88.88 0 0 0-1.234 0c-.164.156-.258.375-.258.605a.85.85 0 0 0 .258.605l7.2 7.1H35.02c-.48 0-.87.387-.87.86a.86.86 0 0 0 .871.855H41a.88.88 0 0 0 .805-.527.86.86 0 0 0 .066-.328v-5.883a.87.87 0 0 0-.87-.855zm-18.78-5.187c-.355.352-.93.352-1.285 0s-.355-.934 0-1.3a.91.91 0 0 1 1.285 0c.355.352.355.934 0 1.3zm3.365-3.367a.91.91 0 0 1-1.285 0 .91.91 0 0 1 0-1.285c.352-.352.93-.352 1.285 0a.91.91 0 0 1 0 1.285zm3.36-3.364a.91.91 0 0 1-1.285 0 .91.91 0 0 1 0-1.285.91.91 0 0 1 1.285 0 .91.91 0 0 1 0 1.285zm0 0"
                                    fill="rgb(100%,100%,100%)"></path>
                            </svg>
                        </div>
                        <h3>Обрезать PDF</h3>
                        <div className="tools__item__content">
                            <p>Выбирайте диапазон страниц, одну страницу или преобразовывайте каждую страницу документа
                                в независимый PDF-файл.</p>
                        </div>
                    </a>
                </div>
            </div>
            <button className="top-left-button5" onClick={redirectToProfile}>
                Профиль
            </button>

        </div>
    );
};

export default Welcome;
