import React, { useContext, useEffect, useState } from 'react';
import { useNavigate } from 'react-router-dom';
import './Styles/Welcome.css';
import  {TypeContext} from "./Context";


const Welcome = () => {
    const navigate = useNavigate();
    const [isButtonVisible, setButtonVisible] = useState(true);
    const [inputValue, setInputValue] = useState('');
    const [json, setJson] = useState('')
    const {type,setType} = useContext(TypeContext)


    useEffect(() => {
        loginButton();
    }, []);

    useEffect(() => {
        console.log("Type updated:", type);
        // пример: переход на другую страницу после обновления type
    }, [type]); // отслеживаем изменения в type


    const loginButton = async () => {
        try {
            const response = await fetch('https://localhost:8080/api/authorization', {
                method: 'GET',
                credentials: 'include'
            });
            if (response.status === 200) {
                setButtonVisible(false);
            } else {
                setButtonVisible(true);
            }
        } catch (error) {
            console.error('Failed to fetch authorization:', error);
        }
    };

    const redirectToLogin = () => {
        navigate('/login');
    };

    const redirectTo =  (url, typeOf) => {
        setType(typeOf);
    };


    const redirectToProfile = async () => {
                navigate('/profile');
    };

    const redirectToAudioList = () => {
        navigate('/audio_playlist');
    };

    const handleInputChange = (event) => {
        setInputValue(event.target.value);
    };

    return (
        <div className="container">
            {isButtonVisible && (
                <button className="Reg_button" onClick={redirectToLogin}>
                    Sign in or sign up
                </button>
            )}
            <div className="tools__container">
                <div className="tools__item" onClick={()=>redirectTo("pdfToDoc")}>
                    <a href="/converter">
                        <div className="tools__item__icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 50 50">
                                <path
                                    d="M17.676 34.344h9.55c2.477 0 3.375-.258 4.28-.742a5.04 5.04 0 0 0 2.098-2.102c.484-.902.742-1.8.742-4.277v-9.547H44.82c1.8 0 2.453.188 3.113.54s1.176.87 1.527 1.527.54 1.31.54 3.113V44.82c0 1.8-.187 2.453-.54 3.113a3.69 3.69 0 0 1-1.527 1.527c-.66.352-1.312.54-3.113.54H22.855c-1.8 0-2.453-.187-3.113-.54s-1.172-.87-1.527-1.527-.54-1.312-.54-3.113zm0 0"
                                    fillRule="evenodd" fill="rgb(37.254902%,51.372549%,77.647059%)"></path>
                                <path
                                    d="M43.94 37.137c0-.477-.395-.863-.883-.863s-.883.387-.883.863v3.844l-5.145-5.047c-.348-.34-.902-.34-1.25 0a.85.85 0 0 0-.258.609.86.86 0 0 0 .258.613l5.145 5.05h-3.914c-.488 0-.883.387-.883.867s.395.867.883.867h6.05c.113-.004.227-.023.336-.07a.87.87 0 0 0 .477-.465c.05-.105.066-.22.066-.332l.004-5.934zm0 0"
                                    fill="rgb(100%,100%,100%)"></path>
                                <path
                                    d="M27.145 32.324H5.18c-1.8 0-2.453-.187-3.113-.543S.89 30.914.54 30.254 0 28.95 0 27.145V5.18c0-1.8.188-2.453.54-3.113A3.69 3.69 0 0 1 2.066.539C2.727.188 3.38 0 5.18 0h21.965c1.8 0 2.453.188 3.113.54s1.172.87 1.527 1.527.54 1.313.54 3.113v21.965c0 1.8-.187 2.453-.54 3.113s-.87 1.176-1.527 1.527-1.312.54-3.113.54zm0 0"
                                    fillRule="evenodd" fill="rgb(86.27451%,89.803922%,98.039216%)"></path>
                                <path
                                    d="M20.844 8.61h2.96l-2.94 14.64H17.77l-1.777-9.035-1.824 9.035h-3.203L8.04 8.61h3.164l1.508 9.363 1.938-9.363h3.004l.04.203 1.688 9.1zm0 0"
                                    fill="rgb(16.078431%,34.117647%,58.431373%)"></path>
                            </svg>
                        </div>
                        <h3>Word в PDF</h3>
                        <div className="tools__item__content">
                            <p>Конвертировать ваши документы в PDF-файл, который будет таким же самым как и оригинальный
                                DOC
                                или DOCX.</p>
                        </div>
                    </a>
                </div>
                <div className="tools__item">
                    <a href="/converter" title="PDF в Word">
                        <div className="tools__item__icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 50 50">
                                <path
                                    d="M32.324 15.656h-9.547c-2.477 0-3.375.258-4.28.742a5.04 5.04 0 0 0-2.098 2.102c-.484.902-.742 1.8-.742 4.277v9.547H5.18c-1.8 0-2.45-.187-3.113-.54-.648-.348-1.184-.88-1.527-1.527-.352-.66-.54-1.31-.54-3.113V5.18c0-1.8.188-2.45.54-3.113S1.4.89 2.066.54 3.38 0 5.18 0h21.965c1.8 0 2.453.188 3.113.54.648.344 1.18.88 1.527 1.527.352.66.54 1.313.54 3.113zm0 0"
                                    fill-rule="evenodd" fill="rgb(86.27451%,89.803922%,98.039216%)"></path>
                                <path
                                    d="M14.477 7.52a.88.88 0 0 0-.883-.867c-.48 0-.883.39-.883.867v3.844L7.566 6.316a.89.89 0 0 0-1.246 0c-.168.16-.258.38-.258.61s.1.453.258.613l5.145 5.05H7.547c-.488 0-.883.387-.883.863s.398.867.883.867h6.055a.92.92 0 0 0 .336-.066c.215-.086.387-.254.477-.47.05-.102.066-.215.066-.328l.004-5.938zm0 0"
                                    fill="rgb(16.078431%,34.117647%,58.431373%)"></path>
                                <path
                                    d="M22.855 17.676H44.82c1.8 0 2.45.188 3.113.543a3.68 3.68 0 0 1 1.527 1.523c.352.66.54 1.313.54 3.113V44.82c0 1.8-.187 2.45-.54 3.113s-.867 1.176-1.527 1.527-1.312.54-3.113.54H22.855c-1.8 0-2.453-.187-3.113-.54-.648-.344-1.18-.88-1.527-1.527-.352-.66-.54-1.312-.54-3.113V22.855c0-1.8.188-2.453.54-3.113.348-.648.88-1.18 1.527-1.527.66-.352 1.313-.54 3.113-.54zm0 0"
                                    fill-rule="evenodd" fill="rgb(37.254902%,51.372549%,77.647059%)"></path>
                                <path
                                    d="M38.996 26.75h2.965l-2.94 14.64h-3.094l-1.777-9.035-1.824 9.035H29.12L26.2 26.75h3.164l1.508 9.363 1.938-9.363h3.004l1.727 9.297zm0 0"
                                    fill="rgb(100%,100%,100%)"></path>
                            </svg>
                        </div>
                        <h3>PDF в Word</h3>
                        <div className="tools__item__content">
                            <p>Конвертируйте ваши PDF файлы в легко редактируемые DOC и DOCX документы. Преобразованный
                                WORD документ будет точным почти на 100%.</p>
                        </div>
                    </a>
                </div>
                <div className="tools__item">
                    <a href="/ru/jpg_to_pdf" title="JPG в PDF">
                        <div className="tools__item__icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 50 50">
                                <path
                                    d="M17.676 34.344h9.55c2.477 0 3.375-.258 4.28-.742a5.04 5.04 0 0 0 2.098-2.102c.484-.902.742-1.8.742-4.277v-9.547H44.82c1.8 0 2.453.188 3.113.54s1.176.87 1.527 1.527.54 1.31.54 3.113V44.82c0 1.8-.187 2.453-.54 3.113a3.69 3.69 0 0 1-1.527 1.527c-.66.352-1.312.54-3.113.54H22.855c-1.8 0-2.453-.187-3.113-.54s-1.172-.87-1.527-1.527-.54-1.312-.54-3.113zm0 0"
                                    fill-rule="evenodd" fill="rgb(98.431373%,93.72549%,65.882353%)"></path>
                                <path
                                    d="M43.94 37.137c0-.477-.395-.863-.883-.863s-.883.387-.883.863v3.844l-5.145-5.047c-.348-.34-.902-.34-1.25 0a.85.85 0 0 0-.258.609.86.86 0 0 0 .258.613l5.145 5.05h-3.914c-.488 0-.883.387-.883.867s.395.867.883.867h6.05c.113-.004.227-.023.336-.07a.87.87 0 0 0 .477-.465c.05-.105.066-.22.066-.332l.004-5.934zm0 0"
                                    fill="rgb(71.764706%,62.745098%,0.392157%)"></path>
                                <g fill-rule="evenodd">
                                    <path
                                        d="M5.184 0h21.988c1.8 0 2.453.188 3.113.54.652.344 1.184.88 1.527 1.53.352.656.54 1.313.54 3.113v21.984c0 1.805-.187 2.457-.54 3.117-.344.648-.875 1.184-1.527 1.527-.66.352-1.312.54-3.113.54H5.184c-1.8 0-2.457-.187-3.113-.54-.652-.344-1.184-.88-1.527-1.527C.188 29.625 0 28.973 0 27.168V5.184c0-1.8.188-2.457.54-3.113.344-.652.88-1.184 1.53-1.53S3.383 0 5.184 0zm0 0"
                                        fill="rgb(83.921569%,74.901961%,17.647059%)"></path>
                                    <path
                                        d="M10.28 12.945v4.688c0 1.66-.926 2.66-2.707 2.66C5.406 20.293 5 18.852 5 18.07c0-.668.31-1.098.86-1.098.648 0 .813.504.813 1.05 0 .516.242.89.88.89.594 0 .926-.44.926-1.3V12.95c0-.54.352-.898.902-.898s.902.36.902.898zm1.672 6.402v-6.102c0-.8.418-1.055 1.055-1.055h2.762c1.516 0 2.738.75 2.738 2.508 0 1.44-1 2.508-2.75 2.508h-2v2.152c0 .54-.355.902-.902.902s-.902-.363-.902-.902zm1.805-5.773v2.242h1.68c.727 0 1.266-.437 1.266-1.12 0-.793-.56-1.12-1.45-1.12zm13.285 3.1v2.984c0 .332-.254.602-.613.602-.52 0-.66-.32-.773-1.023-.516.648-1.23 1.066-2.352 1.066-2.793 0-3.863-1.926-3.863-4.145 0-2.676 1.672-4.148 4.125-4.148 2.004 0 3.07 1.2 3.07 1.902 0 .63-.46.793-.848.793-.89 0-.56-1.242-2.32-1.242-1.242 0-2.223.813-2.223 2.816 0 1.56.77 2.637 2.246 2.637.957 0 1.793-.648 1.88-1.617H24.2c-.383 0-.812-.14-.812-.69 0-.44.254-.69.703-.69h2.223c.527 0 .738.262.738.758zm0 0"
                                        fill="rgb(100%,100%,100%)"></path>
                                </g>
                            </svg>
                        </div>
                        <h3>JPG в PDF</h3>
                        <div className="tools__item__content">
                            <p>Конвертируйте ваши изображения в формат PDF. Регуляция ориентации и полей.</p>
                        </div>
                    </a>
                </div>
                <div className="tools__item">
                    <a href="/ru/pdf_to_jpg" title="PDF в JPG">
                        <div className="tools__item__icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 50 50">
                                <path
                                    d="M32.324 15.656h-9.55c-2.477 0-3.375.258-4.28.742a5.06 5.06 0 0 0-2.098 2.102c-.484.902-.742 1.8-.742 4.277v9.55H5.18c-1.8 0-2.453-.187-3.113-.54a3.69 3.69 0 0 1-1.527-1.527C.188 29.598 0 28.945 0 27.145V5.18c0-1.8.188-2.453.54-3.113A3.69 3.69 0 0 1 2.066.539C2.727.188 3.38 0 5.18 0h21.965c1.8 0 2.453.188 3.113.54a3.69 3.69 0 0 1 1.527 1.527c.352.66.54 1.313.54 3.113zm0 0"
                                    fill-rule="evenodd" fill="rgb(98.431373%,93.72549%,65.882353%)"></path>
                                <path
                                    d="M14.477 7.52c0-.477-.395-.863-.883-.863s-.883.387-.883.863v3.844L7.566 6.316a.89.89 0 0 0-1.246 0c-.168.16-.258.38-.258.61s.1.453.258.613l5.145 5.05H7.55c-.488 0-.883.387-.883.867s.395.863.883.863h6.047a.85.85 0 0 0 .34-.066c.215-.086.387-.254.477-.47.05-.102.066-.215.066-.328l.004-5.934zm0 0"
                                    fill="rgb(71.764706%,62.745098%,0.392157%)"></path>
                                <g fill-rule="evenodd">
                                    <path
                                        d="M22.855 17.676H44.82c1.8 0 2.453.188 3.113.543.648.344 1.184.875 1.527 1.527.352.656.54 1.31.54 3.11V44.82c0 1.8-.187 2.453-.54 3.113a3.69 3.69 0 0 1-1.527 1.527c-.66.352-1.312.54-3.113.54H22.855c-1.8 0-2.453-.187-3.113-.54-.648-.344-1.18-.88-1.527-1.527-.352-.66-.54-1.312-.54-3.113V22.855c0-1.8.188-2.453.54-3.113.348-.648.88-1.18 1.527-1.527.66-.352 1.313-.54 3.113-.54zm0 0"
                                        fill="rgb(83.921569%,74.901961%,17.647059%)"></path>
                                    <path
                                        d="M41.5 26c1.102 0 2 .898 2 2s-.898 2-2 2-2-.898-2-2 .898-2 2-2zM30.6 39h-6.344c-.1 0-.172-.047-.215-.125s-.043-.168.004-.242l6.574-11.02a.26.26 0 0 1 .426 0l3.832 6.422 2.57-2.625c.047-.05.11-.074.176-.074h.008c.07 0 .137.03.18.086l6.1 7.13c.07.043.11.12.11.203 0 .133-.113.242-.246.242H30.6v-.004zm0 0"
                                        fill="rgb(100%,100%,100%)"></path>
                                </g>
                            </svg>
                        </div>
                        <h3>PDF в JPG</h3>
                        <div className="tools__item__content">
                            <p>Извлекайте все изображения, содержащиеся в PDF или конвертируйте каждую страницу в файл
                                JPG.</p>
                        </div>
                    </a>
                </div>
            </div>
            <button className="top-left-button5" onClick={redirectToProfile}>
                Профиль
            </button>
            <button className="uploadButton" onClick={() => navigate('/upload')}>
                Загрузка
            </button>

        </div>
    );
};

export default Welcome;
